nxp-mcuxpresso/mcuxsdk-examples/_boards/mc56f80000evk/driver_examples/queued_spi/edma_b2b_transfer/master/pin_mux.h
/*
 * Copyright 2022 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/*! @name GPIOC3 (number 7), U12[7]
  @{ */
#define BOARD_Boot_RXD0_GPIO GPIOC          /*!<@brief GPIO device name: GPIOC */
#define BOARD_Boot_RXD0_PIN 3U              /*!<@brief GPIOC pin index: 3 */
#define BOARD_Boot_RXD0_PIN_MASK kGPIO_Pin3 /*!<@brief PORT pin mask */
                                            /* @} */

/*! @name GPIOC2 (number 5), U12[6]
  @{ */
#define BOARD_Boot_TXD0_GPIO GPIOC          /*!<@brief GPIO device name: GPIOC */
#define BOARD_Boot_TXD0_PIN 2U              /*!<@brief GPIOC pin index: 2 */
#define BOARD_Boot_TXD0_PIN_MASK kGPIO_Pin2 /*!<@brief PORT pin mask */
                                            /* @} */

/*! @name GPIOC0 (number 3), Y1[1]/EXTAL
  @{ */
#define BOARD_EXTAL_GPIO GPIOC          /*!<@brief GPIO device name: GPIOC */
#define BOARD_EXTAL_PIN 0U              /*!<@brief GPIOC pin index: 0 */
#define BOARD_EXTAL_PIN_MASK kGPIO_Pin0 /*!<@brief PORT pin mask */
                                        /* @} */

/*! @name GPIOC1 (number 4), Y1[3]/XTAL
  @{ */
#define BOARD_XTAL_GPIO GPIOC          /*!<@brief GPIO device name: GPIOC */
#define BOARD_XTAL_PIN 1U              /*!<@brief GPIOC pin index: 1 */
#define BOARD_XTAL_PIN_MASK kGPIO_Pin1 /*!<@brief PORT pin mask */
                                       /* @} */

/*! @name GPIOC8 (number 33), J2[10]/U13[2]/MISO0
  @{ */
#define BOARD_MISO0_GPIO GPIOC          /*!<@brief GPIO device name: GPIOC */
#define BOARD_MISO0_PIN 8U              /*!<@brief GPIOC pin index: 8 */
#define BOARD_MISO0_PIN_MASK kGPIO_Pin8 /*!<@brief PORT pin mask */
                                        /* @} */

/*! @name GPIOC9 (number 34), J2[12]/U13[6]/SCK0
  @{ */
#define BOARD_SCK0_GPIO GPIOC          /*!<@brief GPIO device name: GPIOC */
#define BOARD_SCK0_PIN 9U              /*!<@brief GPIOC pin index: 9 */
#define BOARD_SCK0_PIN_MASK kGPIO_Pin9 /*!<@brief PORT pin mask */
                                       /* @} */

/*! @name GPIOC10 (number 35), J2[8]/U13[5]/MOSI0
  @{ */
#define BOARD_MOSI0_GPIO GPIOC           /*!<@brief GPIO device name: GPIOC */
#define BOARD_MOSI0_PIN 10U              /*!<@brief GPIOC pin index: 10 */
#define BOARD_MOSI0_PIN_MASK kGPIO_Pin10 /*!<@brief PORT pin mask */
                                         /* @} */

/*! @name GPIOC6 (number 31), J1[3]
  @{ */
#define BOARD_ENC_I_GPIO GPIOC          /*!<@brief GPIO device name: GPIOC */
#define BOARD_ENC_I_PIN 6U              /*!<@brief GPIOC pin index: 6 */
#define BOARD_ENC_I_PIN_MASK kGPIO_Pin6 /*!<@brief PORT pin mask */
                                        /* @} */

/*! @name GPIOC7 (number 32), J1[14]/U13[1]/SS0
  @{ */
#define BOARD_SS0_GPIO GPIOC          /*!<@brief GPIO device name: GPIOC */
#define BOARD_SS0_PIN 7U              /*!<@brief GPIOC pin index: 7 */
#define BOARD_SS0_PIN_MASK kGPIO_Pin7 /*!<@brief PORT pin mask */
                                      /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
